1.case_case_simpleFOAM_Laminar/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0]; // m/s

internalField   uniform (1 0 0); // velocidade inicial no x=1 m/s

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    
    outlet
    {
        type zeroGradient;
    }

    wall
    {
        type noSlip;
    }
}
