1.case_case_simpleFOAM_Laminar/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object transportProperties;
}

transportModel  Newtonian;
nu              1e-5; // viscosidade cinemática [m²/s]
