1.case_case_simpleFOAM_Laminar/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
 (-5 -5 -5)
 ( 5 -5 -5)
 ( 5  5 -5)
 (-5  5 -5)

 (-5 -5 5)
 ( 5 -5 5)
 ( 5  5 5)
 (-5  5 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 60 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    boxWalls
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

mergePatchPairs
(
);
