1.case_case_simpleFOAM_Laminar/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers false;

geometry
{
    wall
    {
        type triSurfaceMesh;
        file "wall.stl";
    }

    inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }

    outlet
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    
    nCellsBetweenLevels 3;

    features ();

    refinementSurfaces
    {
        wall
        {
            level (2 2);
        }

        inlet
        {
            level (2 2);
        }

        outlet
        {
            level (2 2);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions {}

    locationInMesh (0 0 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls {}

meshQualityControls {
    maxNonOrtho 65;

    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    maxConcave 80;

    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;

    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;
    }   

mergeTolerance 1e-6;
